# ElementStructuralTypeFilter Constructor (StructuralType)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementStructuralTypeFilter Constructor (StructuralType)
ElementStructuralTypeFilter Class See Also
---
Constructs a new instance of a filter to match elements by structural type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementStructuralTypeFilter(
	StructuralType structuralType
)
```

Visual Basic
---
```text
Public Sub New ( _
	structuralType As StructuralType _
)
```

Visual C++
---
```text
public:
ElementStructuralTypeFilter(
	StructuralType structuralType
)
```

# ### Parameters
structuralType
    Type: Autodesk.Revit.DB.Structure..::..StructuralType The structural type to match.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ElementStructuralTypeFilter Class
ElementStructuralTypeFilter Overload
Autodesk.Revit.DB Namespace